
public class Main {
    public static void main(String[] args) {
        Text s = new Text("– Який    жанр музики ви слухаєте   в повсякденному житті?\n" +
                "– Насправді    намагаюся не слухати. Бо    сприймаю її як інформацію,    яка лягає на мою підсвідомість і   автоматично потім    прокручується, як платівка.\n" +
                "– Скількома мовами співаєте?\n" +
                "– Я рахував, приблизно     шістьма мовами.\n" +
                "– Вашу групу називають    одною з найкращих у світі, що для вас це означає і яку відповідальність покладає?\n" +
                "– Самолюбство   особливо це  не   тішить");
        System.out.println("Звичайний текст:");
        s.print();
        System.out.println("\nТекст, очищений від пробілів:");
        s.without_spaces().print();
        Main_tasks Result = new Main_tasks();
        Result.result(s);
    }
}